src/cf/Documents/уатНачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатНачислениеЗарплаты</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияДатаНачала</Name>
					<Comment>Период начисления дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Comment>Период регистрации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУдержано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
					<Comment>Начисления</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Comment>Вид расчета</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноДней</Name>
							<Comment>Отработано дней</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Comment>Отработано часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Comment>Подразделение организации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Comment>Результат</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Comment>Сотрудник</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Comment>Вид расчета</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.уатУдержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Comment>Подразделение организации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Comment>Результат</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Comment>Сотрудник</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CalculationRegisters/уатОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>уатОсновныеНачисления</Name>
			<Comment>Начисления (уат)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.уатОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТарифыЗП</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/cf/CalculationRegisters/уатУдержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>уатУдержания</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.уатУдержания</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТарифыЗП</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/cf/Documents/уатНачислениеПремий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатНачислениеПремий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.уатОсновныеНачисления</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПланыПримененияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма премий в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТарифыЗП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатНачислениеЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.Подразделение, "Объект.Организация");
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.НачисленияПодразделениеОрганизации, "Объект.Организация");
	
	ОбновитьИтогиНачисленияИУдержания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// уатУправлениеАвтотранспортом.МодификацияКонфигурации
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПериодРегистрации = ТекущаяДата();
		ОпределитьДатыПериодаНачисления();
	КонецЕсли;
	ОбновитьМесяцПредставление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьИтогиНачисленияИУдержания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ОпределитьДатыПериодаНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	ОпределитьДатыПериодаНачисления();
	ОбновитьМесяцПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	стандПериод = Новый СтандартныйПериод;
	стандПериод.Вариант = ВариантСтандартногоПериода.Месяц;
	стандПериод.ДатаНачала = НачалоМесяца(Объект.ПериодНачисленияДатаНачала);
	стандПериод.ДатаОкончания = КонецМесяца(Объект.ПериодНачисленияДатаНачала);
	
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период = стандПериод;
	ДиалогВыбораПериода.Показать(Новый ОписаниеОповещения("ВыборПериодаНачисленияЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура НачисленияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		ОбновитьИтогиНачисленияИУдержания();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПослеУдаления(Элемент)
	ОбновитьИтогиНачисленияИУдержания();
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(Элемент, Элементы.Начисления.ТекущиеДанные.Сотрудник,
		Новый Структура("Организация, Подразделение", Объект.Организация, Объект.Подразделение), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникОткрытие(Элемент, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Элементы.Начисления.ТекущиеДанные.Сотрудник, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", Объект.Организация, Объект.Дата);
		уатИнтерфейсВводаСотрудников.СотрудникАвтоПодборТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", Объект.Организация, Объект.Дата);
		уатИнтерфейсВводаСотрудников.СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура УдержанияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		ОбновитьИтогиНачисленияИУдержания();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдержанияПослеУдаления(Элемент)
	ОбновитьИтогиНачисленияИУдержания();
КонецПроцедуры

&НаКлиенте
Процедура УдержанияСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(Элемент, Элементы.Удержания.ТекущиеДанные.Сотрудник,
		Новый Структура("Организация, Подразделение", Объект.Организация, Объект.Подразделение), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура УдержанияСотрудникОткрытие(Элемент, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Элементы.Удержания.ТекущиеДанные.Сотрудник, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура УдержанияСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", Объект.Организация, Объект.Дата);
		уатИнтерфейсВводаСотрудников.СотрудникАвтоПодборТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура УдержанияСотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", Объект.Организация, Объект.Дата);
		уатИнтерфейсВводаСотрудников.СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
	КонецПроцедуры
	
#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьПоОсновнымНачислениям(Команда)
	Если Объект.Начисления.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Table will be cleared before filling! Continue?';ru='Перед заполнением начисления будут очищены! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОсновнымНачислениямЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
        Возврат;  
	КонецЕсли;  
	
	ЗаполнитьПоОсновнымНачислениямФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОсновнымНачислениямЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    Иначе
        Объект.Начисления.Очистить();
    КонецЕсли;  
    
    ЗаполнитьПоОсновнымНачислениямФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОсновнымНачислениямФрагмент()
    
    ЗаполнитьОсновнымиНачислениями();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСУчетомПремийИУдержаний(Команда)
	
	Если Объект.Начисления.Количество() > 0 ИЛИ Объект.Удержания.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Tables will be cleared before filling! Continue?';ru='Перед заполнением начисления и удержания будут очищены! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьСУчетомПремийИУдержанийЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
        Возврат;  
	КонецЕсли;  
	
	ЗаполнитьСУчетомПремийИУдержанийФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСУчетомПремийИУдержанийЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    Иначе
        Объект.Начисления.Очистить();
		Объект.Удержания.Очистить();
    КонецЕсли;  
    
    ЗаполнитьСУчетомПремийИУдержанийФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСУчетомПремийИУдержанийФрагмент()
	
	ЗаполнитьОсновнымиНачислениями(Истина);
    ЗаполнитьУдержаниями();

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОпределитьДатыПериодаНачисления()
	Объект.ПериодНачисленияДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
	Объект.ПериодНачисленияДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
КонецПроцедуры

// Функция возвращает дату в формате месяц прописью + год
// Например, "Январь 2008"
&НаКлиенте
Функция ДатаКакМесяцПредставление(ДатаДата)
	Возврат Формат(ДатаДата, "ДФ='ММММ гггг'");
КонецФункции // ДатаКакМесяцПредставление()

&НаКлиенте
Функция ОбновитьМесяцПредставление()
	МесяцСтрока = ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецФункции

&НаСервере
Процедура ЗаполнитьОсновнымиНачислениями(флУчитыватьПремии = Ложь)
	
	тблРабочееВремяПоПодразделениям = уатОбщегоНазначения.РабочееВремяСотрудниковПоПодразделениям(
		Объект.ПериодНачисленияДатаНачала, КонецДня(Объект.ПериодНачисленияДатаОкончания),, Объект.Организация);
	
	Запрос = Новый Запрос;
    Запрос.Текст =
	"ВЫБРАТЬ
	|	тблРабочееВремяПоПодразделениям.Сотрудник КАК Сотрудник,
	|	тблРабочееВремяПоПодразделениям.Подразделение КАК Подразделение,
	|	тблРабочееВремяПоПодразделениям.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|	тблРабочееВремяПоПодразделениям.ДатаРаботы КАК ДатаРаботы,
	|	тблРабочееВремяПоПодразделениям.ВремяОборот КАК ВремяОборот
	|ПОМЕСТИТЬ ВТ_РабочееВремяПоПодразделениям
	|ИЗ
	|	&тблРабочееВремяПоПодразделениям КАК тблРабочееВремяПоПодразделениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник КАК Сотрудник,
	|	уатРабочееВремяСотрудниковОбороты.Подразделение КАК Подразделение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатРабочееВремяСотрудниковОбороты.ДатаРаботы) КАК ДнейОборот,
	|	СУММА(уатРабочееВремяСотрудниковОбороты.ВремяОборот) КАК ВремяОборот
	|ПОМЕСТИТЬ ВТ_Работа
	|ИЗ
	|	ВТ_РабочееВремяПоПодразделениям КАК уатРабочееВремяСотрудниковОбороты
	|ГДЕ
	|	(уатРабочееВремяСотрудниковОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.уатВидыИспользованияРабочегоВремени.Явка)
	|			ИЛИ уатРабочееВремяСотрудниковОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.уатВидыИспользованияРабочегоВремени.Праздники))
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник,
	|	уатРабочееВремяСотрудниковОбороты.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник КАК Сотрудник,
	|	уатРабочееВремяСотрудниковОбороты.Подразделение КАК Подразделение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатРабочееВремяСотрудниковОбороты.ДатаРаботы) КАК ДнейОборот,
	|	СУММА(уатРабочееВремяСотрудниковОбороты.ВремяОборот) КАК ВремяОборот
	|ПОМЕСТИТЬ ВТ_Ремонты
	|ИЗ
	|	ВТ_РабочееВремяПоПодразделениям КАК уатРабочееВремяСотрудниковОбороты
	|ГДЕ
	|	уатРабочееВремяСотрудниковОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.уатВидыИспользованияРабочегоВремени.Ремонт)
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник,
	|	уатРабочееВремяСотрудниковОбороты.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	уатОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	СУММА(уатОсновныеНачисления.Результат) КАК Результат,
	|	уатОсновныеНачисления.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	РегистрРасчета.уатОсновныеНачисления КАК уатОсновныеНачисления
	|ГДЕ
	|	уатОсновныеНачисления.Организация = &Организация
	|	И уатОсновныеНачисления.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
	|	И (&флУчитыватьПремии ИЛИ НЕ уатОсновныеНачисления.Регистратор ССЫЛКА Документ.уатНачислениеПремий)
	|
	|СГРУППИРОВАТЬ ПО
	|	уатОсновныеНачисления.Сотрудник,
	|	уатОсновныеНачисления.ВидРасчета,
	|	уатОсновныеНачисления.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Ремонты.Сотрудник ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Работа.Сотрудник ЕСТЬ NULL
	|						ТОГДА ВТ_Начисления.Сотрудник
	|					ИНАЧЕ ВТ_Работа.Сотрудник
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_Ремонты.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТ_Ремонты.Подразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Работа.Подразделение ЕСТЬ NULL
	|						ТОГДА ВТ_Начисления.Подразделение
	|					ИНАЧЕ ВТ_Работа.Подразделение
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_Ремонты.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВТ_Работа.ДнейОборот КАК Дней,
	|	ВТ_Работа.ВремяОборот КАК Время,
	|	ВТ_Ремонты.ДнейОборот КАК ДнейВРемонте,
	|	ВТ_Ремонты.ВремяОборот КАК ВремяВРемонте,
	|	ВТ_Начисления.ВидРасчета КАК ВидРасчета,
	|	ВТ_Начисления.Результат КАК Результат
	|ПОМЕСТИТЬ ВТ_ОбщаяТаблица
	|ИЗ
	|	ВТ_Работа КАК ВТ_Работа
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Начисления КАК ВТ_Начисления
	|			ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|			ПО (ВТ_Ремонты.Сотрудник = ВТ_Начисления.Сотрудник)
	|				И (ВТ_Ремонты.Подразделение = ВТ_Начисления.Подразделение)
	|		ПО ВТ_Работа.Сотрудник = ВТ_Начисления.Сотрудник
	|			И ВТ_Работа.Подразделение = ВТ_Начисления.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_ОбщаяТаблица.ВидРасчета КАК ВидРасчета,
	|	ВТ_ОбщаяТаблица.Результат КАК Результат,
	|	ВТ_ОбщаяТаблица.Сотрудник КАК Сотрудник,
	|	ВТ_ОбщаяТаблица.Дней КАК Дней,
	|	ЕСТЬNULL(ВТ_ОбщаяТаблица.Время, 0) КАК Время,
	|	ВЫБОР
	|		КОГДА ВТ_ОбщаяТаблица.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.уатОсновныеНачисления.ОплатаПоЧасовомуТарифу)
	|				ИЛИ ВТ_ОбщаяТаблица.ВидРасчета ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЕстьЧасы,
	|	ВТ_ОбщаяТаблица.ДнейВРемонте КАК ДнейВРемонте,
	|	ВТ_ОбщаяТаблица.ВремяВРемонте КАК ВремяВРемонте,
	|	ВТ_ОбщаяТаблица.Подразделение КАК ПодразделениеОрганизации
	|ИЗ
	|	ВТ_ОбщаяТаблица КАК ВТ_ОбщаяТаблица
	|ГДЕ
	|	(&Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ИЛИ ВТ_ОбщаяТаблица.Подразделение = &Подразделение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ВидРасчета
	|ИТОГИ
	|	СУММА(Результат),
	|	МАКСИМУМ(Дней),
	|	МАКСИМУМ(Время),
	|	МАКСИМУМ(ЕстьЧасы),
	|	МАКСИМУМ(ПодразделениеОрганизации)
	|ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
    Запрос.УстановитьПараметр("ДатаНач",       Объект.ПериодНачисленияДатаНачала);
    Запрос.УстановитьПараметр("ДатаКон",       КонецДня(Объект.ПериодНачисленияДатаОкончания));
    Запрос.УстановитьПараметр("Организация",   Объект.Организация);
	Запрос.УстановитьПараметр("тблРабочееВремяПоПодразделениям",   тблРабочееВремяПоПодразделениям);
	Запрос.УстановитьПараметр("флУчитыватьПремии", флУчитыватьПремии);
		
    Результат = Запрос.Выполнить();
    
    ВыборкаСотрудник = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СправочникПодразделенияПустаяСсылка = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	
    Пока ВыборкаСотрудник.Следующий() Цикл
		Если ВыборкаСотрудник.Сотрудник = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаСотрудник.Сотрудник.Организация) И (ВыборкаСотрудник.Результат <> NULL ИЛИ ВыборкаСотрудник.Дней <> NULL) Тогда
			ТекстНСТР = НСтр(
				"en='Charges %1, days %2, hours %3 of the driver ""%4"" can not be reflected in the document, so it is not listed in any company.';"
				"ru='Начисления %1, дни %2, часы %3 водителя ""%4"" не могут быть отражены в документе, так он не числится ни в одной организации.'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, ВыборкаСотрудник.Результат, ВыборкаСотрудник.Дней, Окр(ВыборкаСотрудник.Время/3600,2), ВыборкаСотрудник.Сотрудник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Иначе
            ВыборкаДетали = ВыборкаСотрудник.Выбрать();
			КоличествоСтрокПоСотруднику = 0;
			
            Пока ВыборкаДетали.Следующий() Цикл
                НоваяСтрока = Объект.Начисления.Добавить();
                НоваяСтрока.Сотрудник  = ВыборкаДетали.Сотрудник;
                НоваяСтрока.Результат  = ?(ВыборкаДетали.Результат  = NULL,0,ВыборкаДетали.Результат);
                НоваяСтрока.ВидРасчета = ?(ВыборкаДетали.ВидРасчета = NULL,
										ПланыВидовРасчета.уатОсновныеНачисления.ОплатаПоЧасовомуТарифу, ВыборкаДетали.ВидРасчета);
                
				Если ВыборкаДетали.ВидРасчета = NULL ИЛИ
						ВыборкаДетали.ВидРасчета = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаПоЧасовомуТарифу Тогда
                    НоваяСтрока.ОтработаноДней =  ?(ВыборкаДетали.Дней= NULL,0,ВыборкаДетали.Дней);
                    НоваяСтрока.ОтработаноЧасов =  ?(ВыборкаДетали.Время= NULL,0,Окр(ВыборкаДетали.Время/3600,2));
                КонецЕсли; 
                Если ВыборкаДетали.ВидРасчета = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт Тогда
                    НоваяСтрока.ОтработаноДней =  ?(ВыборкаДетали.ДнейВРемонте= NULL,0,ВыборкаДетали.ДнейВРемонте);
                    НоваяСтрока.ОтработаноЧасов =  ?(ВыборкаДетали.ВремяВРемонте= NULL,0,
													Окр(ВыборкаДетали.ВремяВРемонте/3600,2));
                КонецЕсли; 
                
                НоваяСтрока.ПодразделениеОрганизации = ?(ВыборкаДетали.ПодразделениеОрганизации = NULL, 
														СправочникПодразделенияПустаяСсылка, ВыборкаДетали.ПодразделениеОрганизации) ;
														
                КоличествоСтрокПоСотруднику = КоличествоСтрокПоСотруднику + 1;
            КонецЦикла;
			
			// Строка с заполненным отработанными часами и днями добавляется, только если по сотруднику
			// не было начислений с видом ОплатаПоЧасовомуТарифу.
			// Если не добавлять эту строку, то теряется информация по отработанным часам и дням.
			Если ВыборкаСотрудник.ЕстьЧасы = 0 И ВыборкаСотрудник.Дней <> NULL Тогда
				Если КоличествоСтрокПоСотруднику = 1 И НоваяСтрока.ОтработаноДней = 0 И НоваяСтрока.ОтработаноЧасов = 0 Тогда
					// Если у сотрудника есть только одна строка с заполненной суммой и незаполнеными днями и часами,
					// то дни и часы записываются в неё, и новая строка не создается
					НоваяСтрока.ОтработаноДней  =  ?(ВыборкаСотрудник.Дней= NULL,0,ВыборкаСотрудник.Дней);
					НоваяСтрока.ОтработаноЧасов =  ?(ВыборкаСотрудник.Время= NULL,0,
													Окр(ВыборкаСотрудник.Время/3600,2));
				Иначе
					// Иначе добавляется новая строка с нулевой суммой и заполненными днями и часами
					НоваяСтрока = Объект.Начисления.Добавить();
					НоваяСтрока.Сотрудник = ВыборкаСотрудник.Сотрудник;
					НоваяСтрока.ВидРасчета = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаПоЧасовомуТарифу;
					НоваяСтрока.ПодразделениеОрганизации = ?(ВыборкаДетали.ПодразделениеОрганизации = NULL, 
					СправочникПодразделенияПустаяСсылка, ВыборкаСотрудник.ПодразделениеОрганизации) ;
					НоваяСтрока.ОтработаноДней  =  ?(ВыборкаСотрудник.Дней= NULL,0,ВыборкаСотрудник.Дней);
					НоваяСтрока.ОтработаноЧасов =  ?(ВыборкаСотрудник.Время= NULL,0,
													Окр(ВыборкаСотрудник.Время/3600,2));
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
    КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУдержаниями()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатУдержания.Сотрудник КАК Сотрудник,
	|	уатУдержания.ВидРасчета КАК ВидРасчета,
	|	уатУдержания.Подразделение КАК ПодразделениеОрганизации,
	|	СУММА(уатУдержания.Результат) КАК Результат
	|ИЗ
	|	РегистрРасчета.уатУдержания КАК уатУдержания
	|ГДЕ
	|	уатУдержания.Организация = &Организация
	|	И (&Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ИЛИ уатУдержания.Подразделение = &Подразделение)
	|	И уатУдержания.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
	|
	|СГРУППИРОВАТЬ ПО
	|	уатУдержания.Сотрудник,
	|	уатУдержания.ВидРасчета,
	|	уатУдержания.Подразделение
	|");
	Запрос.УстановитьПараметр("ДатаНач",       Объект.ПериодНачисленияДатаНачала);
    Запрос.УстановитьПараметр("ДатаКон",       КонецДня(Объект.ПериодНачисленияДатаОкончания));
    Запрос.УстановитьПараметр("Организация",   Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	ОбновитьИтогиНачисленияИУдержания();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаНачисленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПериодРегистрации = НачалоМесяца(Результат.ДатаНачала);
	
	ОпределитьДатыПериодаНачисления();
	ОбновитьМесяцПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока = Истина
		И НЕ Копирование Тогда
		ТекСтрока = Элементы.Начисления.ТекущиеДанные;
		ТекСтрока.ПодразделениеОрганизации = Объект.Подразделение;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиНачисленияИУдержания()
	тблНачисления = Объект.Начисления.Выгрузить(, "Сотрудник, Результат");
	тблУдержания  = Объект.Удержания.Выгрузить(, "Сотрудник, Результат");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	тблНачисления.Сотрудник КАК Сотрудник,
	|	тблНачисления.Результат КАК Результат
	|ПОМЕСТИТЬ времНачисления
	|ИЗ
	|	&тблНачисления КАК тблНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тблУдержания.Сотрудник КАК Сотрудник,
	|	тблУдержания.Результат КАК Результат
	|ПОМЕСТИТЬ времУдержания
	|ИЗ
	|	&тблУдержания КАК тблУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	времНачисления.Сотрудник КАК Сотрудник,
	|	времНачисления.Результат КАК Начислено,
	|	0 КАК Удержано
	|ПОМЕСТИТЬ времНачисленияУдержания
	|ИЗ
	|	времНачисления КАК времНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	времУдержания.Сотрудник,
	|	0,
	|	времУдержания.Результат
	|ИЗ
	|	времУдержания КАК времУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	времНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	СУММА(времНачисленияУдержания.Начислено) КАК Начислено,
	|	СУММА(времНачисленияУдержания.Удержано) КАК Удержано
	|ПОМЕСТИТЬ времНачисленияУдержанияСвернутая
	|ИЗ
	|	времНачисленияУдержания КАК времНачисленияУдержания
	|
	|СГРУППИРОВАТЬ ПО
	|	времНачисленияУдержания.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	времНачисленияУдержанияСвернутая.Сотрудник КАК Сотрудник,
	|	времНачисленияУдержанияСвернутая.Начислено КАК Начислено,
	|	времНачисленияУдержанияСвернутая.Удержано КАК Удержано,
	|	времНачисленияУдержанияСвернутая.Начислено - времНачисленияУдержанияСвернутая.Удержано КАК Результат
	|ИЗ
	|	времНачисленияУдержанияСвернутая КАК времНачисленияУдержанияСвернутая
	|ГДЕ
	|	времНачисленияУдержанияСвернутая.Начислено > 0 ИЛИ времНачисленияУдержанияСвернутая.Удержано > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник");
	Запрос.УстановитьПараметр("тблНачисления", тблНачисления);
	Запрос.УстановитьПараметр("тблУдержания",  тблУдержания);
	
	тблИтоги = Запрос.Выполнить().Выгрузить();
	
	НачисленияИУдержания.Загрузить(тблИтоги);
	
	Объект.СуммаНачислено = Объект.Начисления.Итог("Результат");
	Объект.СуммаУдержано  = Объект.Удержания.Итог("Результат");
	ИтогоРезультат = Объект.СуммаНачислено - Объект.СуммаУдержано;
КонецПроцедуры

#КонецОбласти
